Catalogs/ШкалыПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ШкалыПроцентныхСтавок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Шкала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МинимальноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентнаяСтавка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШкалыПроцентныхСтавок/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Должны быть указаны нижний и верхний диапазоны значений шкалы,
	// не должно быть пересечений диапазонов, а также не должно быть разрывов (но это не сделано)
	
	ПроверитьКорректностьШкалы(Отказ); 
		
	// Фиксация результата проверки
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПроверитьКорректностьШкалы(Отказ)
	
	Если ЭтотОбъект.Шкала.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеШкалы.НомерСтроки КАК НомерСтроки,
		|	ДанныеШкалы.МинимальноеЗначение КАК МинимальноеЗначение,
		|	ДанныеШкалы.МаксимальноеЗначение КАК МаксимальноеЗначение,
		|	ДанныеШкалы.ПроцентнаяСтавка КАК ПроцентнаяСтавка
		|ПОМЕСТИТЬ _ДанныеШкалы
		|ИЗ
		|	&ДанныеШкалы КАК ДанныеШкалы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""Не задан нижний диапазон шкалы (строка с незаполненным минимальным значением)"" КАК ТекстОшибки,
		|	""Шкала"" КАК Реквизит,
		|	NULL КАК НомерСтроки,
		|	NULL КАК НомерСтроки2
		|ИЗ
		|	_ДанныеШкалы КАК _ДанныеШкалы
		|ГДЕ
		|	_ДанныеШкалы.МинимальноеЗначение = 0
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(_ДанныеШкалы.НомерСтроки) ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Не задан верхний диапазон шкалы (с незаполненным максимальным значением)"",
		|	""Шкала"",
		|	NULL,
		|	NULL
		|ИЗ
		|	_ДанныеШкалы КАК _ДанныеШкалы
		|ГДЕ
		|	_ДанныеШкалы.МаксимальноеЗначение = 0
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(_ДанныеШкалы.НомерСтроки) ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Обнаружено пересечение диапазонов значений в строках %1 и %2"",
		|	""Шкала[%1].МинимальноеЗначение"",
		|	_ДанныеШкалы.НомерСтроки,
		|	_ДанныеШкалы1.НомерСтроки
		|ИЗ
		|	_ДанныеШкалы КАК _ДанныеШкалы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеШкалы КАК _ДанныеШкалы1
		|		ПО (_ДанныеШкалы1.НомерСтроки > _ДанныеШкалы.НомерСтроки)
		|			И (_ДанныеШкалы1.МинимальноеЗначение < _ДанныеШкалы.МаксимальноеЗначение
		|				ИЛИ _ДанныеШкалы.МаксимальноеЗначение = 0)
		|			И (_ДанныеШкалы1.МаксимальноеЗначение > _ДанныеШкалы.МинимальноеЗначение
		|				ИЛИ _ДанныеШкалы1.МаксимальноеЗначение = 0)");
	
	Запрос.УстановитьПараметр("ДанныеШкалы", ЭтотОбъект.Шкала.Выгрузить()); 
	
	ОшибкиШкалы = Запрос.Выполнить().Выбрать();
	Пока ОшибкиШкалы.Следующий() Цикл
		Если ОшибкиШкалы.НомерСтроки2 = NULL Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкиШкалы.ТекстОшибки, ЭтотОбъект, ОшибкиШкалы.Реквизит, , Отказ);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(ОшибкиШкалы.ТекстОшибки, ОшибкиШкалы.НомерСтроки, ОшибкиШкалы.НомерСтроки2),
				ЭтотОбъект,
				СтрШаблон(ОшибкиШкалы.Реквизит, Формат(ОшибкиШкалы.НомерСтроки - 1, "ЧН=; ЧГ=")), , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
